app/controllers/classes_controller.rb

  def list
    @user = Staff.find_by(staff_id: session[:id])
    @classes = Classes.all()
---
SELECT "staffs".* FROM "staffs" WHERE "staffs"."staff_id" = ? LIMIT ?  [["staff_id", "a1710000"], ["LIMIT", 1]]
SELECT "classes".* FROM "classes"