app/controllers/index_controller.rb

  def index
    @user = Student.find_by(student_id: session[:id])
---
SELECT "students".* FROM "students" WHERE "students"."student_id" = ? LIMIT ?  [["student_id", "a1711111"], ["LIMIT", 1]]