app/controllers/login_controller.rb

  def index
    if params[:id] != nil
      session[:id] = params[:id]
    end

    id = session[:id]

    if Student.exists?(student_id: id) #&& Student.password == params[:password]
      redirect_to index_path(id), notice: "Logged in successfully"

    elsif Staff.exists?(staff_id: id)
---
SELECT 1 AS one FROM "students" WHERE "students"."student_id" = ? LIMIT ?  [["student_id", "a1711111"], ["LIMIT", 1]]
SELECT 1 AS one FROM "staffs" WHERE "staffs"."staff_id" = ? LIMIT ?  [["staff_id", "a1711111"], ["LIMIT", 1]]