app/controllers/staff_controller.rb

  def index
    @user = Staff.find_by(staff_id: session[:id])
---
SELECT "staffs".* FROM "staffs" WHERE "staffs"."staff_id" = ? LIMIT ?  [["staff_id", "a1710000"], ["LIMIT", 1]]